CutBackgroundPatternColor Property
 The color of the material cut background pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color CutBackgroundPatternColor { get; set; }
Visual Basic
Public Property CutBackgroundPatternColor As Color
	Get
	Set
Visual C++
public:
property Color^ CutBackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →